In [3]:
import pandas as pd
import numpy as np
data = [{'a': i, 'b':2*i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

## 널 값 연산하기
- isnull()
- notnull()
- dropna()
- fillna()

In [4]:
data=pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [9]:
print(data.dropna())
print()
print(data)

0        1
2    hello
dtype: object

0        1
1      NaN
2    hello
3     None
dtype: object

In [7]:
data.fillna("NO!!!")

0        1
1    NO!!!
2    hello
3    NO!!!
dtype: object

In [10]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [14]:
# axis=0 ==> 행 삭제
df.dropna(axis=0)

     0    1  2
1  2.0  3.0  5

In [15]:
# axis=1 ==> 열 삭제
df.dropna(axis=1)

   2
0  2
1  5
2  6